<a href="https://colab.research.google.com/github/M-sw5/MyProject/blob/main/ai05_sc12x_%EC%98%A4%EC%8A%B9%EC%9B%90.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SC12x

## 데이터 탐색 및 가설 검정

이번 SC 에서 여러분은 가상의 마케팅 데이터를 활용한 통계 분석을 진행하시게 됩니다. 

## 데이터셋 정보 :   
이 데이터셋은 알뜰 구매를 도와주는 XYZ사의 마케팅 정보를 다룹니다. 개인 정보는 보호를 위해 제거 되어 있습니다.

**Attribute Information:**
> 2,240 customers of XYZ company:

- ID - 고객의 고유값
- Year_Birth - 고객의 출생연도
- Education - 고객의 최종학력
- Marital_Status - 고객의 혼인여부
- Country - 고객의 국적
- Income - 고객의 연간 수입
- Kidhome - 자녀가 미취학아동인지 여부 (1 - yes, 0 - no)
- Teenhome - 자녀가 10대 청소년인지 여부 (1 - yes, 0 - no)
- Dt_Customer - 서비스 가입 시기
- Recency - 마지막 구매 시기 (일)
- MntWines - 최근 2년간 구매한 와인 구매 총액
- MntFruits- 최근 2년간 구매한 과일 구매 총액
- MntMeatProducts - 최근 2년간 구매한 정육 구매 총액
- MntFishProducts - 최근 2년간 구매한 어류 구매 총액
- MntSweetProducts - 최근 2년간 구매한 과자 구매 총액
- MntGoldProds - 최근 2년간 구매한 황금 구매 총액
- NumDealsPurchases - 할인을 통해 제품을 구매한 횟수
- NumWebPurchases - 회사의 웹사이트를 통해 구매한 횟수
- NumStorePurchases - 가게에서 직접 구매한 횟수
- NumWebVisitsMonth - 회사의 웹사이트를 방문한 횟수
- Complain - 고객의 최근 2년간 회사에 대한 클레임 여부 (1 - yes, 0 - no)

## Part 1 - 데이터 불러오기

### 1) 데이터셋을 업로드합니다

In [6]:
# 이 곳에 답안을 작성하십시오
import pandas as pd
df = pd.read_csv("sc12x_dataset.csv" ,index_col=0)
df.head()

      ID  Year_Birth Country  ... NumStorePurchases NumWebVisitsMonth Complain
0   1826        1970      SP  ...                 6                 1        0
1      1        1961      CA  ...                 7                 5        0
2  10476        1958      US  ...                 5                 2        0
3   1386        1967     AUS  ...                 2                 7        0
4   5371        1989      SP  ...                 2                 7        0

[5 rows x 21 columns]

### 2) 결측치가 있는지 확인한 후 있다면 제거하세요

In [7]:
# 이 곳에 답안을 작성하십시오

df.isna().sum()

ID                    0
Year_Birth            0
Country               0
Education             0
Marital_Status        0
 Income              24
Kidhome               0
Teenhome              0
Dt_Customer           0
Recency               0
MntWines              0
MntFruits             0
MntMeatProducts       0
MntFishProducts       0
MntSweetProducts      0
MntGoldProds          0
NumDealsPurchases     0
NumWebPurchases       0
NumStorePurchases     0
NumWebVisitsMonth     0
Complain              0
dtype: int64

In [8]:
df.shape

(2240, 21)

In [11]:
df.dropna(inplace = True)

In [12]:
df.shape

(2216, 21)

### 3) 아래의 특성들을 만드세요

1. **TotalMntProducts** - 최근 2년간 구매한 모든 제품 가격들을 합한 값을 가진 계산한 특성입니다

2. **TotalNumPurchases** - 구매횟수를 모두 합친 값을 가진 특성입니다

3. **DaysSinceJoined** - 오늘 날짜를 기준으로 가입한 기간을 보여주는 특성입니다 

4. **VIP** - 누적 구매 금액이 $2,000 이상을 넘고, 오늘을 기준으로 가입기간이 5년 이상이 된다면 1, 아니면 0의 값을 가진 칼럼을 만듭니다

In [13]:
# 답안 작성은 이 곳에 하십시오

df.columns

Index(['ID', 'Year_Birth', 'Country', 'Education', 'Marital_Status',
       ' Income ', 'Kidhome', 'Teenhome', 'Dt_Customer', 'Recency', 'MntWines',
       'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumStorePurchases', 'NumWebVisitsMonth', 'Complain'],
      dtype='object')

In [24]:
df['TotalMntProducts'] = df[(['MntWines','MntFruits','MntMeatProducts','MntFishProducts', 'MntSweetProducts', 'MntGoldProds'])].sum(axis=1)
df['TotalNumPurchases'] = df[(['NumDealsPurchases', 'NumWebPurchases','NumStorePurchases'])].sum(axis=1)

In [25]:
df.head()

      ID  Year_Birth Country  ... Complain TotalMntProducts TotalNumPurchases
0   1826        1970      SP  ...        0             1190                11
1      1        1961      CA  ...        0              577                15
2  10476        1958      US  ...        0              251                 9
3   1386        1967     AUS  ...        0               11                 4
4   5371        1989      SP  ...        0               91                 7

[5 rows x 23 columns]

In [33]:
df['Dt_Customer']= pd.to_datetime(df['Dt_Customer'])
df['DaysSinceJoined'] = (pd.Timestamp.today()) - df['Dt_Customer']

In [34]:
df.head()

      ID  Year_Birth  ...          DatysSinceJoined           DaysSinceJoined
0   1826        1970  ... 2608 days 05:28:09.682452 2608 days 05:46:20.531396
1      1        1961  ... 2609 days 05:28:09.682452 2609 days 05:46:20.531396
2  10476        1958  ... 2642 days 05:28:09.682452 2642 days 05:46:20.531396
3   1386        1967  ... 2644 days 05:28:09.682452 2644 days 05:46:20.531396
4   5371        1989  ... 2677 days 05:28:09.682452 2677 days 05:46:20.531396

[5 rows x 25 columns]

In [40]:
df.loc[((df['TotalMntProducts'] >= 2000) & (df["DaysSinceJoined"] >= pd.Timedelta("1825 days"))), 'VIP'] = 1
df.loc[~((df['TotalMntProducts'] >= 2000) & (df["DaysSinceJoined"] >= pd.Timedelta("1825 days"))), 'VIP'] = 0
df.head()

      ID  Year_Birth Country  ... TotalNumPurchases           DaysSinceJoined VIP
0   1826        1970      SP  ...                11 2608 days 05:46:20.531396   0
1      1        1961      CA  ...                15 2609 days 05:46:20.531396   0
2  10476        1958      US  ...                 9 2642 days 05:46:20.531396   0
3   1386        1967     AUS  ...                 4 2644 days 05:46:20.531396   0
4   5371        1989      SP  ...                 7 2677 days 05:46:20.531396   0

[5 rows x 25 columns]

In [ ]:
# 내가 조건 찾아서 한 방식 reference가 더 명료하지만 아래 방법은 나중에 써먹자.

'''
import numpy as np

conditions = [(df["TotalMntProducts"] >= 2000) & (df['DaysSinceJoined'] >= 1825)]
df['VIP'] = np.select(conditions, '1', default='0')
'''

In [ ]:
df[(df['VIP'] =='1')].head()

        ID  Year_Birth Country  ... TotalNumPurchases DaysSinceJoined VIP
70    1772        1975      CA  ...                12            3113   1
77    7919        1976      SP  ...                18            3264   1
283   3403        1958      SP  ...                14            3222   1
335   3698        1983      SP  ...                12            3268   1
376  10133        1970      CA  ...                18            2716   1

[5 rows x 25 columns]

## Part 2 - 가설 검정

### Hypothesis Test    
   - 수치형 (numerical/continuous) 칼럼이 어떤 차이를 보이는지 t-test를 통해 가설을 세우고 검증하세요. (최소 2개)
   - 범주형 (categorical) 칼럼이 어떤 차이를 보이는지 $\chi^2-test$를 통해 가설을 세우고 검증하세요. (최소 2개)  
  **Hint:** categorical feature 간의 "cross tab"을 생성하여 탐색해 보세요 (aka [contingency tables](https://en.wikipedia.org/wiki/Contingency_table)). 그리고 $\chi^2 test$를 적용해 보세요. [pandas.crosstab](http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html)을 사용하면 contingency table 을 생성할 수 있습니다. 그리고 [scipy.stats.chi2_contingency](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.chi2_contingency.html)를 사용하면 $\chi^2$ statistics 를 계산할 수 있습니다.

In [43]:
# t-test 1
from scipy import stats

'''
H0(귀무가설) = 웹 방문 횟수와 웹 구매 횟수 평균은 유사하다.
H1(대립가설) = 웹 방문 횟수와 웹 구매 횟수 평균은 다르다
'''
nwpur = df['NumWebPurchases']
nwvis = df['NumWebVisitsMonth']

stats.ttest_ind(nwpur, nwvis) # p-value가 0.05 이하이므로 귀무가설을 기각한다.

Ttest_indResult(statistic=-15.868628969476251, pvalue=3.3783031233520634e-55)

In [52]:
# t-test2

'''
H0: vip 회원과 일반 회원의 평균 구매금액은 같다. 
H1: vip 회원과 일반 회의의 구매금액은 차이가 있다. 
'''

dfv = df[(df['VIP'] == 1)] #dfv: VIP 회원
dfv = dfv['TotalMntProducts']

dfg = df[(df["VIP"] == 0)] #일반회원
dfg = dfg['TotalMntProducts'] 

stats.ttest_ind(dfv, dfg) # p-value가 0.05 이하이므로 귀무가설을 기각한다.

Ttest_indResult(statistic=20.20873600956494, pvalue=1.7588803129345406e-83)

In [54]:
# chi-square 1번

from scipy.stats import ttest_ind, chi2_contingency

 
'''
H0: 국가와 vip여부는 독립적이다. 연관이 없다.
H1: 국가와 vip 여부는 서로 연관성이 있다. 
'''

chi2_contingency(pd.crosstab(df["VIP"], df['Country'])) # p-value가 0.05보다 커 귀무가설을 기각할 수 없다.

(5.638150226756089,
 0.5825768447356177,
 7,
 array([[1.43683213e+02, 2.59998195e+02, 1.13382671e+02, 1.43683213e+02,
         2.93231047e+00, 3.29396209e+02, 1.06833845e+03, 1.04585740e+02],
        [3.31678700e+00, 6.00180505e+00, 2.61732852e+00, 3.31678700e+00,
         6.76895307e-02, 7.60379061e+00, 2.46615523e+01, 2.41425993e+00]]))

In [55]:
# Chi-square 2번

'''
H0: 교육 수준과 혼인 여부는 관련성이 없다. 
H1: 교육 수준과 혼연 여부는 관련성이 있다. 
'''

chi2_contingency(pd.crosstab(df["Education"], df['Marital_Status'])) # p-value가 0.05보다 커 귀무가설을 기각할 수 없다.

(26.77652169741452,
 0.5304403824967144,
 28,
 array([[1.80505415e-01, 2.70758123e-01, 2.09386282e+01, 7.73465704e+01,
         4.25090253e+01, 5.17148014e+01, 6.85920578e+00, 1.80505415e-01],
        [4.87364621e-02, 7.31046931e-02, 5.65342960e+00, 2.08835740e+01,
         1.14774368e+01, 1.39629964e+01, 1.85198556e+00, 4.87364621e-02],
        [1.00722022e+00, 1.51083032e+00, 1.16837545e+02, 4.31593863e+02,
         2.37200361e+02, 2.88568592e+02, 3.82743682e+01, 1.00722022e+00],
        [3.29422383e-01, 4.94133574e-01, 3.82129964e+01, 1.41157491e+02,
         7.75789711e+01, 9.43795126e+01, 1.25180505e+01, 3.29422383e-01],
        [4.34115523e-01, 6.51173285e-01, 5.03574007e+01, 1.86018502e+02,
         1.02234206e+02, 1.24374097e+02, 1.64963899e+01, 4.34115523e-01]]))

## Part 3 - Analysis and Interpretation

자, 위 파트들에서 우리는 데이터들을 잘 관찰했습니다. 다음의 질문들에 텍스트로 답변하십시오.  

1) 여러분들이 수행한 두 개 이상의 t-test 들을 해석하고 설명해 보세요.
2) 여러분들이 수행한 두 개 이상의 $\chi^2$ test 들을 해석하고 설명해 보세요.

** `답안 작성은 이 곳에 하십시오` **

## t-test
### t-test 1번

H0(귀무가설) = 웹 방문 횟수와 웹 구매 횟수 평균은 유사하다.
H1(대립가설) = 웹 방문 횟수와 웹 구매 횟수 평균은 다르다
는 p-value가 0.05보다 작으므로 귀무가설을 기각할 수 있다. 즉 웹 방문 평균횟수와 구매 평균 횟수는 통계적으로 유의미한 차이가 있다고 볼 수 있다. 

### t-test 2번
H0: vip 회원과 일반 회원의 평균 구매금액은 같다. 
H1: vip 회원과 일반 회의의 구매금액은 차이가 있다. 
는 p-value가 0.05보다 작다. 따라서 귀무가설을 기각하며, vip회원과 일반 회원의 구매금액의 평균은 통계적으로 유의미한 차이가 있다고 볼 수 있다. 


## 카이제곱
### 카에제곱 1번

H0: 국가와 vip여부는 독립적이다. 연관이 없다.
H1: 국가와 vip 여부는 서로 연관성이 있다.

P-value가 0.05 보다 크므로 귀무가설을 기가하지 못한다. 따라서 국가와 vip여부는 서로 연관이 없다고 결론 지을 수 있다. 

### 카이제곱 2번

H0: 교육 수준과 혼인 여부는 관련성이 없다. 
H1: 교육 수준과 혼연 여부는 관련성이 있다. 

p-value가 0.05보다 크므로 귀무가설을 기각하지 못하며 교육수준과 혼인여부는 서로 연관이 없다고 할 수 있다.

# Advanced Goals: 
> SC 에서 3점을 얻고 싶으시다면 아래의 문제를 모두 풀어주세요. 다만 2점을 얻었다면 충분합니다. 시간과 여유가 있는 분들만 도전해 보시기 바랍니다. 

## Part 1: 

여러분들의 dataframe column들이 적절한 data type을 가지도록 작업해 보세요.   
**Hint:** 특정 column datatype 이 float 이나 integer 로 되어있음에도 불구하고 "object" 라고 되어 있는 경우가 있습니다. 이 경우, `pd.to_numeric()`, `pd.to_datetime()` 과 같은 방법으로 칼럼들을 변환해 보세요. 
주석을 통해 읽는 이가 쉽게 읽을 수 있고, 전체 내용을 쉽게 따라갈 수 있다면 3점을 얻을 수 있습니다. 

## Part 2:

데이터 셋의 적절한 column들의 조합으로 $t-test$와 $\chi^2 test$가 쉽게 수행될 수 있도록 함수를 작성해 보세요.
**데이터 타입에 알맞은 가설검정이 실행되야 하는 것을 잊지 마세요**

## Part 3: 
평균 추정치에 대한 신뢰 구간(confidence interval)을 계산하고 결과를 작성하세요 (최소 두 개 선택). 계산한 추정치가 얼마나 정확한지 시각적으로 확인할 수 있도록 matplotlib, seaborn 등의 시각화 라이브러리를 활용해서 나타내세요

In [ ]:
# 각 파트가 잘 구분되어질 수 있도록 해 주세요

In [ ]:
### 이곳에 Part 1 답안을 작성해주시기 바랍니다

In [ ]:
### 이곳에 Part 2 답안을 작성해주시기 바랍니다

In [ ]:
### 이곳에 Part 3 답안을 작성해주시기 바랍니다